Repository: AzharInam/Taqdir
Catalog: دستاویزات/source/_locale/*/LC_MESSAGES/malumat.po
Languages: fr

source: معلمات
fr: Référence

source: ذرائع
fr: Sources (`ذرائع`)

source: تقدیر کی بنیاد ذرائع نیچے دی جاتی ہیں۔
fr: Les sources de données suivantes sont inclues avec taqdir.

source: تقدیر کے بنیاد ذرائع
fr: Sources incluses avec taqdir

source: ذریعہ
fr: Sources

source: آبوہوا تبدیلی خاکے
fr: Scénario climatique

source: دستیاب سال
fr: Années disponibles

source: مستقبل
fr: Passé

source: ~۱۹۸۳ - آج
fr: ~1983 - présent

source: ۲۰۹۵ تک
fr: jusqu'à 2095

source: تقدیر میں اور بھی ذرائع ہیں جو مسل سے کوائف پڈھتے ہیں۔ یہ مشاہدات کے لئے کام کے ہیں۔
fr: Taqdir offre aussi des sources qui lisent leurs données d'un fichier local. Celles-ci sont particulièrement utiles pour connecter des observations climatiques.

source: متاغیرات
fr: Variables

source: تقدیر میں ان متاغیرات دستیاب ہیں۔
fr: Les variables suivantes sont disponibles dans taqdir.

source: خیال رکھنا کہ ہو سکتا ہیے کہ سارے ذرائع میں سارے متاغیرات دستیاب نہ ہو۔
fr: Veuillez prendre note que toutes ces variables ne sont pas nécessairement disponibles dans toutes les sources.

source: نام
fr: Nom

source: معنی
fr: Définition

source: تاریخ
fr: Date

source: روزنہ (``۲۰۱۸۰۱۰۱``)، مہانہ (``۲۰۱۸۰۱``)، یا سالانہ (``۲۰۱۸``)
fr: Jour (``20180101``), mois (``201801``), ou année (``2018``)

source: بارش
fr: Précipitation

source: ملیمیٹر
fr: mm

source: شمسی_تابکاری
fr: Radiation solaire

source: درجہ_حرارت_زیادہ
fr: Température maximale

source: سلسیوس
fr: °C

source: درجہ_حرارت_کم
fr: Température minimale

source: درجہ_حرارت_اوسط
fr: Température moyenne
