Repository: AzharInam/Taqdir
Catalog: دستاویزات/source/_locale/*/LC_MESSAGES/shuruat.po
Languages: fr

source: شروعات
fr: Où commencer ?

source: تنصیب
fr: Installation

source: تقدیر کہ تنصیب کرنا بہت اسان ہیے۔
fr: C'est assez facile d'installer taqdir :

source: سب سے نئا والا تقدیر گتھب سے مل سکتا ہیے:
fr: Vous pouvez aussi obtenir la version la plus récente directement de Github :

source: تقدیر کام کیسا کارتا ہیے؟
fr: Comment est-ce que ça fonctionne ?

source: اگر آپکے پاس مشاہدات ہیں، تقدیر پہلہ سے ھی کوائف وہاں سے ئٹھایگا۔ بعاد مرکسم (مستقبل کے لئے) اور ناسا (ماضی کے لئے) سے کوائف ڈھونڈنے کی کوشیش کریگا۔
fr: Si vous avez des observations, taqdir y cherchera ses données en premier. Ensuite, il essaiera d'obtenir les données manquantes soit de la NASA (pour le passé), soit de Marksim (pour le future).

source: استعمال کیسا کرنا؟
fr: Comment s'en servir ?

source: پہلہ ایک مقام بنانا جینکے کوائف ہمہیں چاییئے۔ بعاد اسّے کوائف ماں گنا۔ بس۔
fr: D'abord, on doit spécifier l'endroit duquel on aimerait obtenir les données. Ensuite, on demande les données. Et puis c'est tout !

source: from تقدیر.مقام import مقام میرا_مقام = مقام(چوڑائی=11.02, طول=76.96, بلندی=1) کو = میرا_مقام.کوائف_پانا(سے='۲۰۱۸۰۱۰۱', تک='۲۰۱۷۰۱۰۱') کو.لاپتہ() # لاپتہ دنوں کے نام پانا کو.روزانہ() # روزانہ کوائف، پاندس میں # ماہانہ اور سالانہ کوائف بھی میلیں کے۔ کو.ماہانہ() کو.سالانہ() # نتیجہ کو مسل کے تور پر بھی لیکھ سکتے ہیں۔ کو.لکھنا('/میرا/راستہ', '.csv')
fr: from تقدیر.مقام import مقام as endroit mon_endroit = endroit(چوڑائی=11.02, طول=76.96, بلندی=1) données = endroit.کوائف_پانا(سے='20180101', تک='20170101') données.لاپتہ() # obtenir les jours avec des données manquantes données.روزانہ() # données par jour, sous format pandas # On peut aussi obtenir des données mensuelles et annuelles. کو.ماہانہ() کو.سالانہ() # Et on peut aussi sauvegarder les résultats en tant que fichier. données.لکھنا('/mon/dossier', '.csv')

source: اگر آپکے پاس مشاہدات کے کوائف ہیں تو یہ بھی جوڑی جا سکتی ہیں۔
fr: Et, si vous avec des données observées, on peut bien sûr les ajouter aussi.

source: from تقدیر.مقام import مقام from تقدیر.ذرائع import سی_اس_وی میرا_مقام = مقام(چوڑائی=11.02, طول=76.96, بلندی=1) مشاہدات = سی_اس_وی('مشاہدات.csv', چوڑائی=11.02, طول=76.96, بلندی=1) کو = میرا_مقام.کوائف_پانا(سے='۲۰۱۸۰۱۰۱', تک='۲۰۱۷۰۱۰۱', ذرائع=مشاہدات)
fr: from تقدیر.مقام import مقام as endroit from تقدیر.ذرائع import سی_اس_وی as csv_ mon_endroit = endroit(چوڑائی=11.02, طول=76.96, بلندی=1) obs = csv_('مشاہدات.csv', چوڑائی=11.02, طول=76.96, بلندی=1) données = mon_endroit.کوائف_پانا(سے='20180101', تک='20170101', ذرائع=obs)

source: مشاہدات دیسات اور جسان سے بھی پڑی جا سکتی ہیں۔
fr: On peut aussi obtenir les observations de fichiers de format JSON ou DSSAT.
